value of the AddInId as a GUID
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public Guid GetGUID()
  Visual Basic
Public Function GetGUID As Guid
  Visual C++
public:
Guid GetGUID()
 Return Value
 GUID value of the AddInId
 See Also
  AddInId Class
  Autodesk.Revit.DB Namespace